Autodesk.Revit.DB.Structure.FramingProfileServiceData.SetProfileContours(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Sets profile contours.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.FramingProfileServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.FramingProfileServiceData.ErrorCode
Retrieves or changes the error code.
Since:
2016

Autodesk.Revit.DB.Structure.FramingProfileServiceData.FramingElementId
id of the framing element
Since:
2016

Autodesk.Revit.DB.Structure.FramingProfileServiceData.Document
current document
Since:
2016

Autodesk.Revit.DB.Structure.FramingProfileServiceData
This class is used by FramingProfileService and contain
data needed by framing profile server to perform profile update.
The data consist of profile loops and are used in generating mechanism for
fabrication shapes of beams and columns
Remarks:
It's exposed in internal API.
Since:
2016